In [1]:
!pip install sqlalchemy sqlite3 pandas

In [3]:
!pip install SQLAlchemy

In [5]:
import pandas as pd
import sqlite3

In [6]:
conn = sqlite3.connect("spacex.db")

In [7]:
df = pd.read_csv("spacex_cleaned.csv")
df.to_sql("spacex", conn, if_exists="replace", index=False)

205

In [8]:
pd.read_sql_query("SELECT * FROM spacex LIMIT 5;", conn)

,name,date_utc,success,details,core_core,core_flight,core_reused,core_landing_attempt,core_landing_success,core_landing_type,payload_mass_kg,payload_type,payload_orbit
0,FalconSat,2006-03-24T22:30:00.000Z,0,Engine failure at 33 seconds and loss of vehicle,5e9e289df35918033d3b2623,1.0,0,0,None,None,20.000000,Satellite,LEO
1,DemoSat,2007-03-21T01:10:00.000Z,0,Successful first stage burn and transition to ...,5e9e289ef35918416a3b2624,1.0,0,0,None,None,7842.388855,Satellite,LEO
2,Trailblazer,2008-08-03T03:34:00.000Z,0,Residual stage 1 thrust led to collision betwe...,5e9e289ef3591814873b2625,1.0,0,0,None,None,7842.388855,Satellite,LEO
3,RatSat,2008-09-28T23:15:00.000Z,1,Ratsat was carried to orbit on the first succe...,5e9e289ef3591855dc3b2626,1.0,0,0,None,None,165.000000,Satellite,LEO
4,RazakSat,2009-07-13T03:35:00.000Z,1,No details available,5e9e289ef359184f103b2627,1.0,0,0,None,None,200.000000,Satellite,LEO

In [9]:
pd.read_sql_query("SELECT COUNT(*) FROM spacex;", conn)

   COUNT(*)
0       205

In [10]:
pd.read_sql_query("SELECT COUNT(*) FROM spacex WHERE success = 1;", conn)

   COUNT(*)
0       181

In [11]:
pd.read_sql_query("""
SELECT core_core, COUNT(*) as flights
FROM spacex
GROUP BY core_core
ORDER BY flights DESC;
""", conn)

                   core_core  flights
0   5e9e28a7f3591817f23b2663       14
1   5ef670f10059c33cee4a826c       13
2   5e9e28a6f35918c0803b265c       13
3   5f57c53d0622a6330279009f       10
4   5e9e28a5f3591833b13b2659       10
..                       ...      ...
74  5e9e289ef359184f103b2627        1
75  5e9e289ef35918416a3b2624        1
76  5e9e289ef35918187c3b2629        1
77  5e9e289ef3591814873b2625        1
78  5e9e289df35918033d3b2623        1

[79 rows x 2 columns]